u#+Author: Miguel Escalante
#+Title:  My emacs Config
#+PROPERTY: header-args:emacs-lisp :tangle .emacs.d/init.el :mkdirp yes

** Basic Setup
#+begin_src emacs-lisp
  (defun skls/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))))
  (defun skls/org-mode-setup ()
    (toggle-truncate-lines)
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))

  (defun skls/org-mode-visual-fill ()
    (use-package visual-fill-column)
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package org
    :pin org
    :commands (org-capture org-agenda)
    :hook ((org-mode . skls/org-mode-babel)
           (org-mode . skls/org-mode-setup)
           (org-mode . skls/org-mode-visual-fill)
           (org-mode . skls/org-superstar))
    :config
    (setq org-ellipsis " ▾")
    (skls/org-agenda-setup)
    (skls/org-font-setup)
    )
#+end_src

#+RESULTS:
| org-tempo-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (lambda nil (add-hook 'after-save-hook #'skls/org-babel-tangle-config)) | skls/org-superstar | skls/org-mode-visual-fill | skls/org-mode-setup | skls/org-mode-babel | (lambda nil (display-line-numbers-mode 0)) |

